---
title: ChangeType
classe: Autodesk.Revit.DB.ChangeType
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# ChangeType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `changeType.IsValidObject` | Boolean |
| `ChangeType ConcatenateChangeTypes(ChangeType, ChangeType)` | `ChangeType.ConcatenateChangeTypes(changeType1, changeType2)` | ChangeType |
| `Boolean Contains(ChangeType)` | `changeType.Contains(changeType)` | Boolean |
| `Void Dispose()` | `changeType.Dispose()` | Void |
| `Boolean IsIdentical(ChangeType)` | `changeType.IsIdentical(changeType)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```